AlmAck/svdtonuttx/demo/h/da1470x_uart2.h
#define UART2_UART_CTR_MASK                      (0xFFFFFFFF << 0) /* Component Type Register */
#define UART2_UART_CTR_POS                       (0) /* Component Type Register */

/* UART2_DLF Register */

#define UART2_UART_DLF_MASK                      (0xF << 0) /* The fractional value is added to integer value set by DLH, DLL. Fractional value */
#define UART2_UART_DLF_POS                       (0) /* The fractional value is added to integer value set by DLH, DLL. Fractional value */

/* UART2_DMASA Register */

#define UART2_UART_DMASA                         (1U << 0) /* This register is use to perform DMA software acknowledge if a transfer needs to  */

/* UART2_HTX Register */

#define UART2_UART_HALT_TX                       (1U << 0) /* This register is use to halt transmissions, so that the transmit FIFO can be fil */

/* UART2_IER_DLH Register */

#define UART2_PTIME_DLH7                         (1U << 7) /* Interrupt Enable Register: PTIME, Programmable THRE Interrupt Mode Enable. This  */
#define UART2_DLH6_5_MASK                        (0x3 << 5) /* Divisor Latch (High): Bit[6:5] of the 8 bit DLH register */
#define UART2_DLH6_5_POS                         (5) /* Divisor Latch (High): Bit[6:5] of the 8 bit DLH register */
#define UART2_ELCOLR_DLH4                        (1U << 4) /* Interrupt Enable Register: ELCOLR (read only), this bit controls the method for  */
#define UART2_EDSSI_DLH3                         (1U << 3) /* Interrupt Enable Register: EDSSI, Enable Modem Status Interrupt. This is used to */
#define UART2_ELSI_DLH2                          (1U << 2) /* Interrupt Enable Register: ELSI, Enable Receiver Line Status Interrupt. This is  */
#define UART2_ETBEI_DLH1                         (1U << 1) /* Interrupt Enable Register: ETBEI, Enable Transmit Holding Register Empty Interru */
#define UART2_ERBFI_DLH0                         (1U << 0) /* Interrupt Enable Register: ERBFI, Enable Received Data Available Interrupt. This */

/* UART2_IIR_FCR Register */

#define UART2_IIR_FCR_MASK                       (0xFF << 0) /* On Read Interrupt Identification Register : Bits[7:6], FIFO's Enabled (or FIFOSE */
#define UART2_IIR_FCR_POS                        (0) /* On Read Interrupt Identification Register : Bits[7:6], FIFO's Enabled (or FIFOSE */

/* UART2_LCR_EXT Register */

#define UART2_UART_TRANSMIT_MODE                 (1U << 3) /* Transmit mode control bit. This bit is used to control the type of transmit mode */
#define UART2_UART_SEND_ADDR                     (1U << 2) /* Send address control bit. This bit is used as a control knob for the user to det */
#define UART2_UART_ADDR_MATCH                    (1U << 1) /* Address Match Mode.This bit is used to enable the address match feature during r */
#define UART2_UART_DLS_E                         (1U << 0) /* Extension for DLS. This bit is used to enable 9-bit data for transmit and receiv */

/* UART2_LCR Register */

#define UART2_UART_DLAB                          (1U << 7) /* Divisor Latch Access Bit. This bit is used to enable reading and writing of the  */
#define UART2_UART_BC                            (1U << 6) /* Break Control Bit. This is used to cause a break condition to be transmitted to  */
#define UART2_UART_SP                            (1U << 5) /* Stick Parity. (writeable only when UART is not busy USR[0] is 0); otherwise alwa */
#define UART2_UART_EPS                           (1U << 4) /* Even Parity Select. Writeable only when UART is not busy (USR[0] is zero). This  */
#define UART2_UART_PEN                           (1U << 3) /* Parity Enable. Writeable only when UART is not busy (USR[0] is zero) This bit is */
#define UART2_UART_STOP                          (1U << 2) /* Number of stop bits. This is used to select the number of stop bits per characte */
#define UART2_UART_DLS_MASK                      (0x3 << 0) /* Data Length Select. This is used to select the number of data bits per character */
#define UART2_UART_DLS_POS                       (0) /* Data Length Select. This is used to select the number of data bits per character */

/* UART2_LSR Register */

#define UART2_UART_ADDR_RCVD                     (1U << 8) /* Address Received Bit. If 9Bit data mode (LCR_EXT[0]=1) is enabled, this bit is u */
#define UART2_UART_RFE                           (1U << 7) /* Receiver FIFO Error bit. This bit is only relevant when FIFOs are enabled (FCR[0 */
#define UART2_UART_TEMT                          (1U << 6) /* Transmitter Empty bit. If FIFOs enabled (FCR[0] set to one), this bit is set whe */
#define UART2_UART_THRE                          (1U << 5) /* Transmit Holding Register Empty bit. If THRE mode is disabled (IER[7] set to zer */
#define UART2_UART_BI                            (1U << 4) /* Break Interrupt bit. This is used to indicate the detection of a break sequence  */
#define UART2_UART_FE                            (1U << 3) /* Framing Error bit. This is used to indicate the occurrence of a framing error in */
#define UART2_UART_PE                            (1U << 2) /* Parity Error bit. This is used to indicate the occurrence of a parity error in t */
#define UART2_UART_OE                            (1U << 1) /* Overrun error bit. This is used to indicate the occurrence of an overrun error.  */
#define UART2_UART_DR                            (1U << 0) /* Data Ready bit. This is used to indicate that the receiver contains at least one */

/* UART2_MCR Register */

#define UART2_UART_AFCE                          (1U << 5) /* Auto Flow Control Enable. When FIFOs are enabled and the Auto Flow Control Enabl */
#define UART2_UART_LB                            (1U << 4) /* LoopBack Bit. This is used to put the UART into a diagnostic mode for test purpo */
#define UART2_UART_RTS                           (1U << 1) /* Request to Send. This is used to directly control the Request to Send (rts_n) ou */

/* UART2_MSR Register */

#define UART2_UART_CTS                           (1U << 4) /* Clear to Send. This is used to indicate the current state of the modem control l */
#define UART2_UART_DCTS                          (1U << 0) /* Delta Clear to Send. This is used to indicate that the modem control line cts_n  */

